Hello,

Thank you for raising this issue, I got the exact same problem on my side.
After digging a bit, I found out the outputs were not updated correctly depending on the update I do.


Creating the product
```bash
Terraform will perform the following actions:

  # aws_servicecatalog_provisioned_product.test will be created
  + resource "aws_servicecatalog_provisioned_product" "test" {
      + accept_language                        = "en"
      + arn                                    = (known after apply)
      + cloudwatch_dashboard_names             = (known after apply)
      + created_time                           = (known after apply)
      + id                                     = (known after apply)
      + ignore_errors                          = false
      + last_provisioning_record_id            = (known after apply)
      + last_record_id                         = (known after apply)
      + last_successful_provisioning_record_id = (known after apply)
      + launch_role_arn                        = (known after apply)
      + name                                   = (known after apply)
      + outputs                                = (known after apply)
      + path_id                                = "lpv2-cdcjxjskb4mok"
      + product_id                             = "prod-qn5hposz6iuss"
      + provisioning_artifact_id               = "pa-g4ox7dmbphccq"
      + retain_physical_resources              = false
      + status                                 = (known after apply)
      + status_message                         = (known after apply)
      + tags_all                               = (known after apply)
      + type                                   = (known after apply)

      + provisioning_parameters {
          + key   = "value1"
          + value = "v11"
        }
      + provisioning_parameters {
          + key   = "value2"
          + value = "v22"
        }
      + provisioning_parameters {
          + key   = "value3"
          + value = "v33"
        }
    }

  # random_uuid.generate_uuid will be created
  + resource "random_uuid" "generate_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + provisioned-product_outputs = (known after apply)
```

After execution I can find my outputs as expected

```
provisioned-product_outputs = toset([
  {
    "description" = ""
    "key" = "value1Out"
    "value" = "v11"
  },
  {
    "description" = ""
    "key" = "value2Out"
    "value" = "v22"
  },
  {
    "description" = ""
    "key" = "value3Out"
    "value" = "v33"
  },
  {
    "description" = "The ARN of the launched Cloudformation Stack"
    "key" = "CloudformationStackARN"
    "value" = "ANONYMIZED"
  },
])
```
It is coresponding to the output on provisioned product also: 
<img width="998" alt="Capture d’écran 2023-01-20 à 19 39 19" src="https://user-images.githubusercontent.com/10270633/213780391-63d7422d-e8d9-45e3-8e9d-8e346262a3da.png">


Now If I replace the template of the product with another version **including a new output named value4Out** and apply the change again, I can see following:

```
  # aws_servicecatalog_provisioned_product.test will be updated in-place
  ~ resource "aws_servicecatalog_provisioned_product" "test" {
        id                                     = "pp-6klh7ydf2waje"
        name                                   = "test_product_terraform_issue-36d9ad90-f38c-ca6f-9db8-3b849a6d664a"
      ~ provisioning_artifact_id               = "pa-g4ox7dmbphccq" -> "pa-ycc4ovdom2vce"
        tags                                   = {}
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

And after apply I still see the exact same outputs...

```
Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

Outputs:

provisioned-product_outputs = toset([
  {
    "description" = ""
    "key" = "value1Out"
    "value" = "v11"
  },
  {
    "description" = ""
    "key" = "value2Out"
    "value" = "v22"
  },
  {
    "description" = ""
    "key" = "value3Out"
    "value" = "v33"
  },
  {
    "description" = "The ARN of the launched Cloudformation Stack"
    "key" = "CloudformationStackARN"
    "value" = "ANONYMIZED"
  },
])
```
We cannot find the newly added output but when looking at Service Catalog it has been deployed as expected.

<img width="900" alt="Capture d’écran 2023-01-20 à 19 39 25" src="https://user-images.githubusercontent.com/10270633/213780557-261fd1b3-09fe-47f6-94a9-f3db6fd635b0.png">


The only workaround I found for that is to use the refresh command to force terraform to align its outputs to Service Catalog ones.

```
terraform refresh
```


**Reproduction**

- Deploy a provisioned product with at least one output using terraform
- Go to product on ServiceCatalog service -> Seelect your product -> create new version -> provide a cloudformation template with a new output 
- Remove the previous version to keep only one
- terraform apply
- Check terraform state or print outputs of aws_servicecatalog_provisioned_product to see issue
